{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": [
    128009,
    128256
  ],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "max_position_embeddings": 32768,
  "model_type": "mixtral",
  "num_attention_heads": 32,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_local_experts": 64,
  "output_router_logits": false,
  "pad_token_id": 128001,
  "rms_norm_eps": 1e-05,
  "rope_theta": 16000000.0,
  "router_aux_loss_coef": 0.005,
  "router_jitter_noise": 0.0,
  "scoring_func": "softmax",
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.1",
  "use_cache": true,
  "vocab_size": 128259
}
