{
  "metadata": {
    "total_size": 31392559104
  },
  "weight_map": {
    "lm_head.weight": "model-00005-of-00007.safetensors",
    "model.embed_tokens.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.0.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.1.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.10.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.11.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.12.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.13.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.14.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.15.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.16.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.17.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.18.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.19.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.2.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.20.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.21.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.22.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.23.w3.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.24.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.25.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.26.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.27.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.28.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.29.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.3.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.30.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.31.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.32.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.32.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.32.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.33.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.33.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.33.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.34.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.34.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.34.w3.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.35.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.35.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.35.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.36.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.36.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.36.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.37.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.37.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.37.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.38.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.38.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.38.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.39.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.39.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.39.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.4.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.40.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.40.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.40.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.41.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.41.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.41.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.42.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.42.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.42.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.43.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.43.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.43.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.44.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.44.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.44.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.45.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.45.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.45.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.46.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.46.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.46.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.47.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.47.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.47.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.48.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.48.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.48.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.49.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.49.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.49.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.5.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.50.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.50.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.50.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.51.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.51.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.51.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.52.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.52.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.52.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.53.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.53.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.53.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.54.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.54.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.54.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.55.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.55.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.55.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.56.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.56.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.56.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.57.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.57.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.57.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.58.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.58.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.58.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.59.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.59.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.59.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.6.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.60.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.60.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.60.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.61.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.61.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.61.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.62.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.62.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.62.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.63.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.63.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.63.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.7.w3.weight": "model-00007-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.8.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.experts.9.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.block_sparse_moe.gate.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00003-of-00007.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model-00005-of-00007.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model-00002-of-00007.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model-00006-of-00007.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.10.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.11.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.12.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.13.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.14.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.15.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.16.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.17.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.18.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.19.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.2.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.20.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.21.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.22.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.23.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.24.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.25.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.26.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.27.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.28.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.29.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.3.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.30.w3.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.31.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.32.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.32.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.32.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.33.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.33.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.33.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.34.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.34.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.34.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.35.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.35.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.35.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.36.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.36.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.36.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.37.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.37.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.37.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.38.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.38.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.38.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.39.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.39.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.39.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.4.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.40.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.40.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.40.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.41.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.41.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.41.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.42.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.42.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.42.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.43.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.43.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.43.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.44.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.44.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.44.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.45.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.45.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.45.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.46.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.46.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.46.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.47.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.47.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.47.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.48.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.48.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.48.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.49.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.49.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.49.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.5.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.50.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.50.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.50.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.51.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.51.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.51.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.52.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.52.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.52.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.53.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.53.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.53.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.54.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.54.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.54.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.55.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.55.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.55.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.56.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.56.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.56.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.57.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.57.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.57.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.58.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.58.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.58.w3.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.59.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.59.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.59.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.6.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.60.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.60.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.60.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.61.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.61.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.61.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.62.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.62.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.62.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.63.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.63.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.63.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.7.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.8.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.experts.9.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.block_sparse_moe.gate.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00007.safetensors",
    "model.layers.1.self_attn.k_proj.weight": "model-00005-of-00007.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.self_attn.q_proj.weight": "model-00002-of-00007.safetensors",
    "model.layers.1.self_attn.v_proj.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.0.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.1.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.10.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.11.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.12.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.13.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.14.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.15.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.16.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w2.weight": "model-00007-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.17.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.18.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.19.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w2.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.2.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.20.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.21.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.22.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.23.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.24.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.25.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.26.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.27.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.28.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.29.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.3.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.30.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.31.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.32.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.32.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.32.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.33.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.33.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.33.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.34.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.34.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.34.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.35.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.35.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.35.w3.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.36.w1.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.36.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.36.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.37.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.37.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.37.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.38.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.38.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.38.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.39.w1.weight": "model-00007-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.39.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.39.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w1.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w2.weight": "model-00004-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.4.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.40.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.40.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.40.w3.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.41.w1.weight": "model-00006-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.41.w2.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.41.w3.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.42.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.42.w2.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.42.w3.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.43.w1.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.43.w2.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.43.w3.weight": "model-00005-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.44.w1.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.44.w2.weight": "model-00001-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.44.w3.weight": "model-00002-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.45.w1.weight": "model-00003-of-00007.safetensors",
    "model.layers.10.block_sparse_moe.experts.45.w2.weight": "model-00005-of-00007.safetensors",
